In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [3]:
data = pd.Series(np.random.randn(9),
                index=[list('aaabbccdd'), [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data

a  1   -0.769650
   2   -0.281150
   3    1.920899
b  1    0.190450
   3   -1.355695
c  1   -1.990735
   2    1.964385
d  2   -1.794521
   3   -0.683260
dtype: float64

In [5]:
data['a']

1   -0.769650
2   -0.281150
3    1.920899
dtype: float64

In [6]:
data['b']

1    0.190450
3   -1.355695
dtype: float64

In [7]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [8]:
data

a  1   -0.769650
   2   -0.281150
   3    1.920899
b  1    0.190450
   3   -1.355695
c  1   -1.990735
   2    1.964385
d  2   -1.794521
   3   -0.683260
dtype: float64

In [9]:
data['b']

1    0.190450
3   -1.355695
dtype: float64

In [10]:
data.loc[['a', 'b']]

a  1   -0.769650
   2   -0.281150
   3    1.920899
b  1    0.190450
   3   -1.355695
dtype: float64

In [18]:
data.loc[:, 2]

a   -0.281150
c    1.964385
d   -1.794521
dtype: float64

In [19]:
data.unstack()

          1         2         3
a -0.769650 -0.281150  1.920899
b  0.190450       NaN -1.355695
c -1.990735  1.964385       NaN
d       NaN -1.794521 -0.683260

In [20]:
data.unstack().stack()

a  1   -0.769650
   2   -0.281150
   3    1.920899
b  1    0.190450
   3   -1.355695
c  1   -1.990735
   2    1.964385
d  2   -1.794521
   3   -0.683260
dtype: float64

In [25]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns=[['Ohio', 'Ohio', 'Colorado'],
                            ['Green', 'Red', 'Green']])

In [26]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [29]:
frame['Ohio']['Green']['a']

1    0
2    3
Name: Green, dtype: int32

In [30]:
frame.index.names = ['key1', 'key2']

In [31]:
frame.columns.names = ['state', 'color']

In [33]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [34]:
frame['Colorado']

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

In [ ]:
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                      names = [''])